Ran Plan for 5 projects:

1. project: `fileflow-ecr-prod` dir: `terraform/ecr` workspace: `default`
1. project: `fileflow-redis-prod` dir: `terraform/elasticache-redis` workspace: `default`
1. project: `fileflow-s3-prod` dir: `terraform/s3-bucket` workspace: `default`
1. project: `fileflow-sqs-prod` dir: `terraform/sqs-queue` workspace: `default`
1. project: `fileflow-ecs-prod` dir: `terraform/ecs-service` workspace: `default`
---

### 1. project: `fileflow-ecr-prod` dir: `terraform/ecr` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p fileflow-ecr-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FFileFlow%252Fterraform%252Fecr%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p fileflow-ecr-prod
  ```

---
### 2. project: `fileflow-redis-prod` dir: `terraform/elasticache-redis` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p fileflow-redis-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FFileFlow%252Fterraform%252Felasticache-redis%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p fileflow-redis-prod
  ```

---
### 3. project: `fileflow-s3-prod` dir: `terraform/s3-bucket` workspace: `default`
<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_s3_bucket.main has been deleted
- resource "aws_s3_bucket" "main" {
      - arn                         = "arn:aws:s3:::fileflow--prod" -> null
      - bucket_domain_name          = "fileflow--prod.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "fileflow--prod.s3.ap-northeast-2.amazonaws.com" -> null
      - id                          = "fileflow--prod" -> null
        tags                        = {
            "Component"   = "storage"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "Name"        = "fileflow--prod"
            "Owner"       = "platform-team@ryuqqq.com"
            "Purpose"     = null
            "Service"     = "fileflow"
        }
        # (10 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.s3_access must be replaced
-/+ resource "aws_cloudwatch_log_group" "s3_access" {
      ~ arn               = "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/s3/fileflow--prod" -> (known after apply)
      ~ id                = "/aws/s3/fileflow--prod" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/s3/fileflow--prod" -> "/aws/s3/fileflow-prod" # forces replacement
      + name_prefix       = (known after apply)
      ~ tags              = {
            "Component"   = "s3-logging"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
          ~ "Name"        = "log-fileflow--prod" -> "log-fileflow-prod"
            "Owner"       = "platform-team@ryuqqq.com"
            "Service"     = "fileflow"
        }
      ~ tags_all          = {
          ~ "Name"        = "log-fileflow--prod" -> "log-fileflow-prod"
            # (7 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # aws_kms_alias.s3 must be replaced
-/+ resource "aws_kms_alias" "s3" {
      ~ arn            = "arn:aws:kms:ap-northeast-2:646886795421:alias/fileflow--prod" -> (known after apply)
      ~ id             = "alias/fileflow--prod" -> (known after apply)
      ~ name           = "alias/fileflow--prod" -> "alias/fileflow-prod" # forces replacement
      + name_prefix    = (known after apply)
      ~ target_key_arn = "arn:aws:kms:ap-northeast-2:646886795421:key/de3fcbd6-a155-4245-bdeb-d626ef4038ce" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_kms_key.s3 will be updated in-place
~ resource "aws_kms_key" "s3" {
      ~ description                        = "KMS key for fileflow--prod S3 bucket" -> "KMS key for fileflow-prod S3 bucket"
        id                                 = "de3fcbd6-a155-4245-bdeb-d626ef4038ce"
      ~ tags                               = {
            "Component"   = "s3-encryption"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
          ~ "Name"        = "kms-fileflow--prod" -> "kms-fileflow-prod"
            "Owner"       = "platform-team@ryuqqq.com"
            "Service"     = "fileflow"
        }
      ~ tags_all                           = {
          ~ "Name"        = "kms-fileflow--prod" -> "kms-fileflow-prod"
            # (7 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)
    }

  # aws_s3_bucket.main will be created
+ resource "aws_s3_bucket" "main" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "fileflow-prod"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Component"   = "storage"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "fileflow-prod"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Purpose"     = null
          + "Service"     = "fileflow"
        }
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.main will be created
+ resource "aws_s3_bucket_lifecycle_configuration" "main" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "transition-to-ia"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + filter {
                # (1 unchanged attribute hidden)
            }

          + transition {
              + days          = 180
              + storage_class = "DEEP_ARCHIVE"
            }
          + transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
          + transition {
              + days          = 90
              + storage_class = "GLACIER_IR"
            }
        }
      + rule {
          + id     = "expire-old-versions"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + filter {
                # (1 unchanged attribute hidden)
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 90
            }
        }
      + rule {
          + id     = "delete-incomplete-uploads"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 7
            }

          + filter {
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_policy.main will be created
+ resource "aws_s3_bucket_policy" "main" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.main will be created
+ resource "aws_s3_bucket_public_access_block" "main" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.main will be created
+ resource "aws_s3_bucket_server_side_encryption_configuration" "main" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "arn:aws:kms:ap-northeast-2:646886795421:key/de3fcbd6-a155-4245-bdeb-d626ef4038ce"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_s3_bucket_versioning.main will be created
+ resource "aws_s3_bucket_versioning" "main" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_ssm_parameter.bucket_arn will be updated in-place
~ resource "aws_ssm_parameter" "bucket_arn" {
        id              = "/fileflow/prod/s3/bucket-arn"
      + insecure_value  = (known after apply)
        name            = "/fileflow/prod/s3/bucket-arn"
      ~ tags            = {
            "Component"   = "parameter-store"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
          ~ "Name"        = "ssm-fileflow--prod-arn" -> "ssm-fileflow-prod-arn"
            "Owner"       = "platform-team@ryuqqq.com"
            "Service"     = "fileflow"
        }
      ~ tags_all        = {
          ~ "Name"        = "ssm-fileflow--prod-arn" -> "ssm-fileflow-prod-arn"
            # (7 unchanged elements hidden)
        }
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_ssm_parameter.bucket_name will be updated in-place
~ resource "aws_ssm_parameter" "bucket_name" {
        id              = "/fileflow/prod/s3/bucket-name"
      + insecure_value  = (known after apply)
        name            = "/fileflow/prod/s3/bucket-name"
      ~ tags            = {
            "Component"   = "parameter-store"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
          ~ "Name"        = "ssm-fileflow--prod-name" -> "ssm-fileflow-prod-name"
            "Owner"       = "platform-team@ryuqqq.com"
            "Service"     = "fileflow"
        }
      ~ tags_all        = {
          ~ "Name"        = "ssm-fileflow--prod-name" -> "ssm-fileflow-prod-name"
            # (7 unchanged elements hidden)
        }
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_ssm_parameter.kms_key_id will be updated in-place
~ resource "aws_ssm_parameter" "kms_key_id" {
        id              = "/fileflow/prod/s3/kms-key-id"
        name            = "/fileflow/prod/s3/kms-key-id"
      ~ tags            = {
            "Component"   = "parameter-store"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
          ~ "Name"        = "ssm-fileflow--prod-kms" -> "ssm-fileflow-prod-kms"
            "Owner"       = "platform-team@ryuqqq.com"
            "Service"     = "fileflow"
        }
      ~ tags_all        = {
          ~ "Name"        = "ssm-fileflow--prod-kms" -> "ssm-fileflow-prod-kms"
            # (7 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

Plan: 8 to add, 4 to change, 2 to destroy.

Changes to Outputs:
~ bucket_arn                  = "arn:aws:s3:::fileflow--prod" -> (known after apply)
~ bucket_domain_name          = "fileflow--prod.s3.amazonaws.com" -> (known after apply)
~ bucket_id                   = "fileflow--prod" -> (known after apply)
~ bucket_regional_domain_name = "fileflow--prod.s3.ap-northeast-2.amazonaws.com" -> (known after apply)
~ log_group_name              = "/aws/s3/fileflow--prod" -> "/aws/s3/fileflow-prod"
╷
│ Warning: AWS resource not found during refresh
│ 
│   with aws_s3_bucket_lifecycle_configuration.main,
│   on main.tf line 140, in resource "aws_s3_bucket_lifecycle_configuration" "main":
│  140: resource "aws_s3_bucket_lifecycle_configuration" "main" {
│ 
│ Automatically removing from Terraform State instead of returning the error,
│ which may trigger resource recreation. Original error: couldn't find
│ resource
╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p fileflow-s3-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FFileFlow%252Fterraform%252Fs3-bucket%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p fileflow-s3-prod
  ```

**Note: Objects have changed outside of Terraform**
Plan: 8 to add, 4 to change, 2 to destroy.

---
### 4. project: `fileflow-sqs-prod` dir: `terraform/sqs-queue` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p fileflow-sqs-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FFileFlow%252Fterraform%252Fsqs-queue%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p fileflow-sqs-prod
  ```

---
### 5. project: `fileflow-ecs-prod` dir: `terraform/ecs-service` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_role_policy.fileflow_ecr_access will be created
+ resource "aws_iam_role_policy" "fileflow_ecr_access" {
      + id          = (known after apply)
      + name        = "fileflow-prod-ecr-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "fileflow-prod-ecs-execution-role"
    }

  # module.fileflow_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/fileflow-prod/fileflow"
        name                               = "fileflow"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for fileflow"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "fileflow"
            "Owner"       = "platform-team@example.com"
            "Repository"  = "infrastructure"
            "Service"     = "fileflow"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/fileflow:4" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.fileflow_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/fileflow:4" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/fileflow" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "fileflow" -> (known after apply)
      ~ revision                 = 4 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for fileflow"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "fileflow"
            "Owner"       = "platform-team@example.com"
            "Repository"  = "infrastructure"
            "Service"     = "fileflow"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p fileflow-ecs-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FFileFlow%252Fterraform%252Fecs-service%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p fileflow-ecs-prod
  ```
Plan: 2 to add, 1 to change, 1 to destroy.

---
### Plan Summary

5 projects, 2 with changes, 3 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```